def sqrt(a): # корень
    a = a**(1./2)
    return a

# Оперируеме числа
PI = 3.1415926535897932384626433832795028841971693993751058209749445923078164062862089986280348253421170679821480865132823066470938446095505822317253594081284811174502841027019385211055596446229489549303819644288109756659334461284756482337867831652712019091456485669234603486104543266482133936072602491412737245870066063155881748815209209628292540917153643678925903600113305305488204665213841469519415116094330572703657595919530921861173819326117931051185480744623799627495673518857527248912279381830119491298336733624406566430860213949463952247371907021798609437027705392171762931767523846748184676694051320005681271452635608277857713427577896091736371787214684409012249534301465495853710507922796892589235420199561121290219608640344181598136297747713099605187072113499999983729780499510597317328160963185950244594553469083026425223082533446850352619311881710100031378387528865875332083814206171776691473035982534904287554687311595628638823537875937519577818577805321712268066130019278766111959092164201989

# Велечины
def deg(a): # градус
    return a * PI/180
def rad(a): # радиан
    return a * 180/PI

# Функцции
def f(a): # Факториал
    if a == 1 or a == 0:
        return 1
    else:
        return a * f(a - 1)
#синус
def sin(a): # Синус
    return a - a**3 / f(3) + a**5 / f(5) - a**7 / f(7) + a**9 / f(9) - a**11 / f(11) + a**13 / f(13) - a**15 / f(15)
def sind(a): # Cинус градусов
    return sin(deg(a))
def sinr(a): # Синус радиан
    return sin(rad(a))
#косинус
def cos(a): # Косинус
    return 1 - a**2 / f(2) + a**4 / f(4) - a**6 / f(6) + a**8 / f(8) - a**10 / f(10) + a**12 / f(12) - a**14 / f(14)
def cosd(a): # Косинус градусов
    a % 360
    return cos(deg(a)%360)
def cosr(a): # Косинус радиан
    return cos(deg(rad(a)%360))

# Остроугольный треугольник-----------------------
class AcuteTr:
    #угол
    def Inj_II(a, b):#если есть 2 других
        return 180 - (a+b)

# Прямоугольный треугольник-----------------------
class RectTr:
    #угол
    def Inj_II(a, b):#если есть 2 других
        return 180 - (a+b)
    #гипотениза
    def hyp_LL(a, b):#если катеты
        return sqrt(a**2+b**2) 
    #катет 
    def leg_HL(a, b):#если гипотенуза и катет
        return sqrt(a**2-b**2)

# Равнобедренный треугольник-----------------------
class IsosTr:
    #угол
    def Inj_II(a, b):#если есть 2 других
        return 180 - (a+b)
    #сторона
    def side_BH(a, b, f=False):#если основание и высота
        if not f:
            pass
        else:
            print("Решение: ")
            print("Cторона(x) = корень(("+str(a)+"/2)^2+"+str(b)+"^2)")
            print("Сторона(x) = корень("+str((a/2)**2)+"+"+str(b**2)+")")
            print("Сторона(x) = корень("+str((a/2)**2+b**2)+")")
            print("Сторона(x) = "+str(sqrt((a/2)**2+b**2)))
        return sqrt((a/2)**2+b**2)
    def side_BI(a, b):#если основание и угол
        return b/(2*cosd(a))
    #основание
    def base_SH(a, b):#если сторона и высота
        return 2*sqrt(a**2-b**2)
    def base_SI(a, b):#если сторона и угол
        return 2*a * cosd(b)
    #высота
    def height_SB(a, b):#если сторона и основание
        return sqrt(a**2 - (b**2/4))


#вывод
print("\nМатематика")
print("Корень 25\n>>> " + str(sqrt(25)))
print("Факториал 15\n>>> " + str(f(15)))
print("Синус угла 170\n>>> " + str(sind(170)))
print("Косинус радиан 57\n>>> " + str(cosr(57)))

print("\nПрямоугольный треугольник")
print("Гиппотенуза если извесны катеты 2,5\n>>> " + str(RectTr.hyp_LL(2, 5)))
print("Катет если извесны гиппотенуза и катет 15,5\n>>> " + str(RectTr.leg_HL(15, 5)))

print("\nРавнобедренный треугольник")
print("Сторона если извесны основание и высота 5,15\n>>> " + str(IsosTr.side_BH(5, 15)))
print("Основание если извесны сторона и высота 10,9\n>>> " + str(IsosTr.base_SH(10, 9)))
print("Основание если извесны сторона и угол 20,68\n>>> " + str(IsosTr.base_SI(20, 68)))
print("Высота если извесны сторона и основание 20,25\n>>> " + str(IsosTr.height_SB(20, 25)))
print(eval(str(input())))